bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/firmware_wdr.c
    // histogram pre-processing
    wdr_fw_param.hist_clip_level = BIN_BW - 1;

    // WDR curve
    wdr_fw_param.fw_curve_en = 1;
    wdr_fw_param.exclude_over_under_exp_en = 1;
    wdr_fw_param.swing_gain = 18;
    wdr_fw_param.swing_clip = 14;
    wdr_fw_param.protect_slope = 48;
    wdr_fw_param.curve_keep_bright_level = 4;
    wdr_fw_param.bright_gain = 256;

    // post-enhancement
    wdr_fw_param.fw_enh_en = 1;
    wdr_fw_param.empty_ratio = 20;
    wdr_fw_param.enh_keep_bright_level = 4;
    wdr_fw_param.dark_enh_level = 26;
    wdr_fw_param.bright_enh_level = 26;
    wdr_fw_param.enh_c_gain_base = 34;
    wdr_fw_param.enh_c_gain_extra_slope = 48;

    // fallback
    wdr_fw_param.fw_fallback_en = 1;
    wdr_fw_param.peak_sum_range = 1;
    wdr_fw_param.peak_sum_th = 35;
    wdr_fw_param.peak_sum_slope = 82;
    wdr_fw_param.insignificant_bin_ratio = 8;
    wdr_fw_param.insignificant_bin_num_th = 50;
    wdr_fw_param.insignificant_bin_num_slope = 164;

    // temporal smoothing
    wdr_fw_param.temporal_smooth = 22;

    // initialize IIR
    wdr_reg_fw_iir.cs_grey_th = 0;
    wdr_reg_fw_iir.cs_gain = 1 << CS_GAIN_PRECISION;
    wdr_reg_fw_iir.cs_weight = 0;

    wdr_reg_fw_iir.curve_weight = 0;

    for (int ib = 0; ib < BIN_NUM - 1; ib++) {
        wdr_reg_fw_iir.curve[ib] = ib << HIST_WEIGHT_PRECISION;
    }

    wdr_reg_fw_iir.enh_weight = 0;
    wdr_reg_fw_iir.enh_y_offset = 0;
    wdr_reg_fw_iir.enh_y_gain = 1 << ENH_GAIN_PRECISION;
    wdr_reg_fw_iir.enh_c_gain = 1 << ENH_GAIN_PRECISION;

    // increase IIR register precision to avoid permanent residue
    wdr_reg_fw_iir.cs_grey_th <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.cs_gain <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.cs_weight <<= TEMPORAL_IIR_EXTRA_PRECISION;

    wdr_reg_fw_iir.curve_weight <<= TEMPORAL_IIR_EXTRA_PRECISION;

    for (int ib = 0; ib < BIN_NUM - 1; ib++) {
        wdr_reg_fw_iir.curve[ib] <<= TEMPORAL_IIR_EXTRA_PRECISION;
    }

    wdr_reg_fw_iir.enh_weight <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.enh_y_offset <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.enh_y_gain <<= TEMPORAL_IIR_EXTRA_PRECISION;
    wdr_reg_fw_iir.enh_c_gain <<= TEMPORAL_IIR_EXTRA_PRECISION;
}

static void wdr_hw_init(void)
{
    ISP_WDR_Set_CS_State(ENABLE);
    ISP_WDR_Set_WDR_Curve_State(ENABLE);
    ISP_WDR_Set_Post_Enhance_State(ENABLE);
}

void wdr_hw_update(void)
{
    int i;
    ISP_WDR_Curve_Type wdr_curve;
    ISP_Chroma_Suppress_Type cs_cfg;
    // apply wdr curve
    for (i = 0; i < ISP_WDR_CURVE_COEF_NUM; i++) {
        wdr_curve.curve_coef[i] = wdr_reg.curve[i];
    }

    cs_cfg.gain = wdr_reg.cs_gain;
    cs_cfg.weight = wdr_reg.cs_weight;

    ISP_WDR_Set_CS_Config(&cs_cfg);
    ISP_WDR_Set_WDR_Curve(&wdr_curve);
    ISP_WDR_Set_WDR_Curve_Weight(wdr_reg.curve_weight);
    ISP_WDR_Set_Post_Enhance_Weight(wdr_reg.enh_weight);
    ISP_WDR_Set_Post_Enhance_Y_Offset(wdr_reg.enh_y_offset);
    ISP_WDR_Set_Post_Enhance_Luma_Gain(wdr_reg.enh_y_gain);
    ISP_WDR_Set_Post_Enhance_Chroma_Gain(wdr_reg.enh_c_gain);
}

int wdr_control(const wdr_fw_config_t *config)
{

    memcpy(&wdr_fw, config, sizeof(wdr_fw_config_t));

    // run after each frame hardware done (WDR interrupt)
    wdr_decide_chroma_suppression(&wdr_fw);
    wdr_hist_pre_process();
    wdr_decide_curve();
    wdr_decide_enhancement();
    wdr_decide_fallback(&wdr_fw);
    wdr_temporal_smooth();

    return 0;
}


int wdr_init()
{
    //only no sw param, when get sw param, then set sw param
    flag_sw_init = 1;

    wdr_set_reg_default();
    wdr_fw_param_init();
    wdr_hw_init();

    return 0;
}

int wdr_sw_get_fw_register(wdr_param_sw_t *sw, wdr_fw_config_t *fw)
{
    int tbl_num = 0;
    wdr_trans_tbl_t *trans_tbl = NULL;
	trans_tbl = (wdr_trans_tbl_t *)&wdr_trans_use.cs_strength_tbl;
	tbl_num = (int)sizeof(trans_tbl) / (int)sizeof(trans_tbl[0]);

    wdr_get_fw_config(fw);
    table_linear_interpolate(trans_tbl->cs_strength_tbl, trans_tbl->cs_weight_tbl, tbl_num, sw->cs_strength, &fw->param.cs_weight);
    table_linear_interpolate(trans_tbl->cs_strength_tbl, trans_tbl->cs_gain_thresh_tbl, tbl_num, sw->cs_strength, &fw->param.cs_gain_thresh);
    
    fw->param.curve_weight = sw->curve_weight;
    fw->param.enh_weight = sw->enh_weight;
    fw->sys_gain_db = sw->sys_gain_db;

    return 0;
}

int wdr_fw_set_sw_register(wdr_fw_config_t *fw)
{
    int tbl_num = 0;
    wdr_trans_tbl_t *trans_tbl = NULL;
    trans_tbl = (wdr_trans_tbl_t *)&wdr_trans_use.cs_strength_tbl;
	tbl_num = (int)sizeof(trans_tbl) / (int)sizeof(trans_tbl[0]);

    table_linear_interpolate(trans_tbl->cs_weight_tbl, trans_tbl->cs_strength_tbl, tbl_num, fw->param.cs_weight, &wdr_sw.cs_strength);
    wdr_sw.curve_weight = fw->param.curve_weight;
    wdr_sw.enh_weight = fw->param.enh_weight;
    wdr_sw.sys_gain_db = fw->sys_gain_db;

    return 0;
}

void wdr_get_sw_config(wdr_param_sw_t *config)
{
    int tbl_num = 0;
    wdr_trans_tbl_t *trans_tbl = NULL;
    trans_tbl = (wdr_trans_tbl_t *)&wdr_trans_use.cs_strength_tbl;
	tbl_num = (int)sizeof(trans_tbl) / (int)sizeof(trans_tbl[0]);

    if (flag_sw_init == 0) {//only no sw param, when get sw param, then set sw param
        flag_sw_init = 1;
        table_linear_interpolate(trans_tbl->cs_weight_tbl, trans_tbl->cs_strength_tbl, tbl_num, wdr_fw.param.cs_weight, &wdr_sw.cs_strength);
        wdr_sw.curve_weight = wdr_fw.param.curve_weight;
        wdr_sw.enh_weight = wdr_fw.param.enh_weight;
        wdr_sw.sys_gain_db = wdr_fw.sys_gain_db;
    }

    config->cs_strength = wdr_sw.cs_strength;
    config->curve_weight = wdr_sw.curve_weight;
    config->enh_weight = wdr_sw.enh_weight;
    config->sys_gain_db = wdr_sw.sys_gain_db;
}

void wdr_set_sw_config(wdr_param_sw_t *config)
{
    wdr_sw.cs_strength = config->cs_strength;
    wdr_sw.curve_weight = config->curve_weight;
    wdr_sw.enh_weight = config->enh_weight;
    wdr_sw.sys_gain_db = config->sys_gain_db;
}

int wdr_config(wdr_config_t *config, bool is_virtual_sensor)
{
    wdr_set_hist(config->stats_cfg.act_win.width-1, config->stats_cfg.act_win.width-1);
    ISP_WDR_Set_ROI_State(0, ENABLE);
    ISP_WDR_Set_ROI_Weight(0, 1);
    ISP_WDR_Set_ROI_Position(0, 0, config->stats_cfg.act_win.width-1, 0, config->stats_cfg.act_win.height-1);

    if (is_virtual_sensor) {
        wdr_fw_param.temporal_smooth = 0;
    }

