bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Common/isp/firmware_wdr.c
    return 0;
}

static void wdr_decide_chroma_suppression(wdr_fw_config_t *config)
{
    wdr_reg.cs_en = wdr_fw_param.fw_cs_en;

    if (wdr_fw_param.fw_cs_en) {
        // had better be ISO-adaptive, stronger suppression for larger noise
        wdr_reg_fw_curr.cs_grey_th = config->param.cs_gain_thresh;
        wdr_reg_fw_curr.cs_weight  = config->param.cs_weight;

        int divisor = (1 << (PIXEL_BW - 1)) - wdr_reg_fw_curr.cs_grey_th;
        wdr_reg_fw_curr.cs_gain = ((1 << (PIXEL_BW - 1)) * (1 << CS_GAIN_PRECISION) + (divisor - 1)) / divisor;
    }
    else {
        wdr_reg_fw_curr.cs_grey_th = 0;
        wdr_reg_fw_curr.cs_gain = 1 << CS_GAIN_PRECISION;
        wdr_reg_fw_curr.cs_weight = 0;
    }
}

static void wdr_hist_pre_process()
{
    ISP_WDR_Get_Hist_Data(&wdr_reg.hist);

    // shift histogram
    for (int ib = 0; ib < BIN_NUM; ib++) {
        fw_hist_shift[ib] = wdr_reg.hist.hist_bin[ib] >> HIST_SHIFT_LEVEL;
    }

    // calculate histogram total sum
    hist_shift_total = 0;

    for (int ib = 0; ib < BIN_NUM; ib++) {
        hist_shift_total += fw_hist_shift[ib];
    }

    // clip histogram
    int hist_clip_max = hist_shift_total >> wdr_fw_param.hist_clip_level;

    for (int ib = 0; ib < BIN_NUM; ib++) {
        fw_hist_clip[ib] = MIN(hist_clip_max, fw_hist_shift[ib]);
    }

    if (wdr_fw_param.exclude_over_under_exp_en) {
        fw_hist_clip[0] = 0;
        fw_hist_clip[BIN_NUM - 1] = 0;
    }

    // use integral image to reduce calculation of repetitive summation
    fw_hist_clip_integral[0] = 0;

    for (int ib = 1; ib < BIN_NUM + 1; ib++) {
        fw_hist_clip_integral[ib] = fw_hist_clip_integral[ib - 1] + fw_hist_clip[ib - 1];
    }
}

static void wdr_decide_curve()
{
    wdr_reg.curve_en = wdr_fw_param.fw_curve_en;

    if (wdr_fw_param.fw_curve_en) {
        int curve_ini[BIN_NUM];

        // for assertion
        for (int ib = 0; ib < BIN_NUM; ib++) {
            curve_ini[ib] = -1;
        }

        // decide quarter curve points first
        curve_ini[0] = 0;
        curve_ini[BIN_NUM - 1] = 1 << HIST_PIXEL_BW;

        curve_ini[BIN_1ST_QUARTER] = wdr_interpolate_curve(BIN_1ST_QUARTER, 0, BIN_NUM - 1, curve_ini[0], curve_ini[BIN_NUM - 1], fw_hist_clip_integral);
        curve_ini[BIN_3RD_QUARTER] = wdr_interpolate_curve(BIN_3RD_QUARTER, 0, BIN_NUM - 1, curve_ini[0], curve_ini[BIN_NUM - 1], fw_hist_clip_integral);

        curve_ini[BIN_2ND_QUARTER] = wdr_interpolate_curve(BIN_2ND_QUARTER, BIN_1ST_QUARTER, BIN_3RD_QUARTER, curve_ini[BIN_1ST_QUARTER], curve_ini[BIN_3RD_QUARTER], fw_hist_clip_integral);

        curve_ini[BIN_1ST_QUARTER] = alpha_blend(BIN_1ST_QUARTER << HIST_WEIGHT_PRECISION, curve_ini[BIN_1ST_QUARTER], wdr_fw_param.curve_keep_bright_level, KEEP_BRIGHT_LEVEL_PRECISION);
        curve_ini[BIN_2ND_QUARTER] = alpha_blend(BIN_2ND_QUARTER << HIST_WEIGHT_PRECISION, curve_ini[BIN_2ND_QUARTER], wdr_fw_param.curve_keep_bright_level, KEEP_BRIGHT_LEVEL_PRECISION);
        curve_ini[BIN_3RD_QUARTER] = alpha_blend(BIN_3RD_QUARTER << HIST_WEIGHT_PRECISION, curve_ini[BIN_3RD_QUARTER], wdr_fw_param.curve_keep_bright_level, KEEP_BRIGHT_LEVEL_PRECISION);

        for (int step = (BIN_NUM - 1) >> 3; step >= 1; step >>= 1) {
            for (int ib = step; ib < BIN_NUM; ib += (step << 1)) {
                int bin_lf = ib - step;
                int bin_rt = ib + step;

                int curve_lf = curve_ini[bin_lf];
                int curve_rt = curve_ini[bin_rt];

                assert(curve_lf != -1);
                assert(curve_rt != -1);

                curve_ini[ib] = wdr_interpolate_curve(ib, bin_lf, bin_rt, curve_lf, curve_rt, fw_hist_clip_integral);
            }
        }

        for (int ib = 0; ib < BIN_NUM; ib++) {
            assert(curve_ini[ib] != -1);

            if (ib > 0) {
                assert(curve_ini[ib] >= curve_ini[ib - 1]);
            }
        }

        // curve smoothing
        curve_ini[BIN_1ST_QUARTER] = (curve_ini[BIN_1ST_QUARTER - 1] + curve_ini[BIN_1ST_QUARTER + 1]) >> 1;
        curve_ini[BIN_2ND_QUARTER] = (curve_ini[BIN_2ND_QUARTER - 1] + curve_ini[BIN_2ND_QUARTER + 1]) >> 1;
        curve_ini[BIN_3RD_QUARTER] = (curve_ini[BIN_3RD_QUARTER - 1] + curve_ini[BIN_3RD_QUARTER + 1]) >> 1;

        for (int ib = 0; ib < BIN_NUM - 1; ib++) {
            if (ib == 0) {
                wdr_reg_fw_curr.curve[ib] = curve_ini[ib];
            }
            else {
                wdr_reg_fw_curr.curve[ib] = round_off(curve_ini[ib - 1] + (curve_ini[ib] << 1) + curve_ini[ib + 1], 2);
            }
        }

        // adjust brightness
        for (int ib = 0; ib < BIN_NUM - 1; ib++) {
            wdr_reg_fw_curr.curve[ib] = MIN(HIST_PIXEL_MAX, (wdr_reg_fw_curr.curve[ib] * wdr_fw_param.bright_gain) >> BRIGHT_GAIN_PRECISION);
        }
    }
    else {
        for (int ib = 0; ib < BIN_NUM - 1; ib++) {
            wdr_reg_fw_curr.curve[ib] = ib << HIST_WEIGHT_PRECISION;
        }
    }
}

static int wdr_interpolate_curve(int bin_interp, int bin_lf, int bin_rt, int curve_lf, int curve_rt, int hist_integral[])
{
    // sum [a] ~ [b] = integral [b + 1] - [a]
    int sum_lf = hist_integral[bin_interp + 1] - hist_integral[bin_lf];
    int sum_rt = hist_integral[bin_rt + 1] - hist_integral[bin_interp];

    int curve_linear = ((bin_rt - bin_interp) * curve_lf + (bin_interp - bin_lf) * curve_rt + ((bin_rt - bin_lf) >> 1)) / (bin_rt - bin_lf);
    int curve_blend;

    if (sum_lf + sum_rt == 0) {
        curve_blend = curve_linear;
    }
    else {
        curve_blend = (sum_rt * curve_lf + sum_lf * curve_rt + ((sum_lf + sum_rt) >> 1)) / (sum_lf + sum_rt);
    }

    assert(within(curve_lf, curve_rt, curve_blend));

    // protect dynamic range at dark and bright sides
    int protect_ratio = PROTECT_RATIO_MAX - MIN(PROTECT_RATIO_MAX, (abs(bin_interp - BIN_2ND_QUARTER) * wdr_fw_param.protect_slope) >> (PROTECT_SLOPE_PRECISION + (BIN_BW - 1) - PROTECT_RATIO_PRECISION));

    int swing_gain_protect = (wdr_fw_param.swing_gain * protect_ratio) >> PROTECT_RATIO_PRECISION;
    int swing_clip_protect = (wdr_fw_param.swing_clip * protect_ratio) >> PROTECT_RATIO_PRECISION;

